export const MOCK_DATA = [
  {
    title: ' * Введение в Фронтенд Разработку с JavaScript и React',
    subtitle:
      ' * Привіт!\n' +
      '\n' +
      'Чи завжди мріяли стати фахівцем у сфері веб-розробки та зробити свій перший крок у світ Frontend розробки?',
    sections: [
      {
        heading: 'Про курс:',
        content:
          'Цей курс розрахований на абсолютних початківців, а також на тих, хто має невеликий досвід роботи з програмуванням та хоче поглибити свої знання в області веб-розробки. За допомогою нашого досвідченого інструктора з трьома роками практики у розробці на React, ви отримаєте поглиблене розуміння найсучасніших фреймворків та бібліотек, що використовуються у розробці фронтенду.',
      },
      {
        heading: 'Чому варто взяти участь:',
        contentList: [
          'Навчитесь створювати динамічні та інтерактивні веб-додатки з використанням JavaScript та React.',
          'Освоїте основні концепції фронтенд розробки, такі як компонентний підхід та реактивне програмування.',
          'Розуміння принципів роботи веб-додатків, робота з API, та структурування коду.',
          'Навички вирішення завдань, що передбачаються реальними роботодавцями для початківців у цій галузі. Практичні завдання та проєкти, що дозволять вам навчитися на практиці.',
        ],
      },
      {
        heading: 'Деталі курсу:',
        contentList: [
          'Тривалість: 3 місяці',
          'Формат: Онлайн',
          'Вартість: $88 на місяць, або $250 за три місяці',
        ],
      },
      {
        heading: 'Чому ми:',
        contentList: [
          'Досвідчений інструктор з практикою у фронтенд розробці більше 3 років.',
          'Інтерактивні заняття, спрямовані на практику та реальні виклики фронтенд розробки.',
          'Онлайн доступ до навчальних матеріалів та завдань.',
          'Підтримка та консультування під час вивчення.',
          'Сертифікат про успішне завершення курсу.',
        ],
      },
      {
        heading: 'Реєстрація:',
        content:
          'Не втрачайте свій шанс вивчити одну з найзапитуваніших галузей інформаційних технологій. Реєструйтеся на нашому курсі "Введення в Фронтенд Розробку з JavaScript та React" та розпочніть свій шлях до кар\'єри Frontend розробника!',
      },
      {
        heading:
          'Запишіться вже сьогодні та розкрийте свій потенціал у світі веб-розробки У нашого менеджера',
      },
      {
        heading: 'Данна інформація буде доповнюватись та обновлюватись кожного дня, слідкуйте за новинами',
      },
    ],
  },
];
