import React from 'react';
import Button from './button';
import { useNavigate } from 'react-router-dom';

const text = [
  { title: ' * Введение в Фронтенд Разработку с JavaScript и React' },
  {
    subtitle:
      ' * Привіт!\n' +
      '\n' +
      'Чи завжди мріяли стати фахівцем у сфері веб-розробки та зробити свій перший крок у світ Frontend розробки? Ми раді вітати вас на нашому інтенсивному тримісячному курсі "Введення в Фронтенд Розробку з JavaScript та React"!',
  },
];

const Coursea = () => {
  const navigate = useNavigate();
  const handleBack = () => {
    navigate('/');
  };

  return (
    <>
      <h1>{text[0].title}</h1>
      <h2>{text[1].subtitle}</h2>
      <h1>Про курс:</h1>
      <h2>
        Цей курс розрахований на абсолютних початківців, а також на тих, хто має невеликий досвід роботи з
        програмуванням та хоче поглибити свої знання в області веб-розробки. За допомогою нашого досвідченого
        інструктора з трьома роками практики у розробці на React, ви отримаєте поглиблене розуміння
        найсучасніших фреймворків та бібліотек, що використовуються у розробці фронтенду.
      </h2>
      <h1>Чому варто взяти участь:</h1>
      <h2>
        <li>
          Навчитесь створювати динамічні та інтерактивні веб-додатки з використанням JavaScript та React.
        </li>
        <li>
          {' '}
          Освоїте основні концепції фронтенд розробки, такі як компонентний підхід та реактивне програмування.
        </li>
        <li>Розуміння принципів роботи веб-додатків, робота з API, та структурування коду.</li>
        <li>
          Навички вирішення завдань, що передбачаються реальними роботодавцями для початківців у цій галузі.
          Практичні завдання та проєкти, що дозволять вам навчитися на практиці.
        </li>
      </h2>
      <h1>Деталі курсу:</h1>
      <h2>
        <li>Тривалість: 3 місяці</li>
        <li> Формат: Онлайн</li>
        <li> Вартість: $88 на місяць, або $250 за три місяці</li>
      </h2>
      <h1>Чому ми:</h1>
      <h2>
        <li>Досвідчений інструктор з практикою у фронтенд розробці більше 3 років.</li>
        <li> Інтерактивні заняття, спрямовані на практику та реальні виклики фронтенд розробки.</li>
        <li> Онлайн доступ до навчальних матеріалів та завдань.</li>
        <li> Підтримка та консультування під час вивчення.</li>
        <li> Сертифікат про успішне завершення курсу.</li>
      </h2>
      <h1>Реєстрація:</h1>
      <h2>
        Не втрачайте свій шанс вивчити одну з найзапитуваніших галузей інформаційних технологій. Реєструйтеся
        на нашому курсі "Введення в Фронтенд Розробку з JavaScript та React" та розпочніть свій шлях до
        кар'єри Frontend розробника!
      </h2>
      <h1>Запишіться вже сьогодні та розкрийте свій потенціал у світі веб-розробки У нашого менеджера</h1>
      <h1>Данна інформація буде доповнюватись та обновлюватись кожного дня, слідкуйте за новинами</h1>
      <Button text="BACK" handleClick={handleBack} />
    </>
  );
};

export default Coursea;
